#### Terraform Format and Style 🖌
#### Environment staging (CD)
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
confluent_environment.env: Refreshing state... [id=env-d9d2z7]
confluent_kafka_cluster.standard: Refreshing state... [id=lkc-19y203]
confluent_service_account.platform-manager: Refreshing state... [id=sa-g1j58r]
confluent_role_binding.platform-manager-kafka-cluster-admin: Refreshing state... [id=rb-0O4DN]
confluent_api_key.platform-manager-kafka-api-key: Refreshing state... [id=LMC2R5TNPGGHZOK2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # confluent_api_key.platform-manager-kafka-api-key must be replaced
-/+ resource "confluent_api_key" "platform-manager-kafka-api-key" {
      ~ id                     = "LMC2R5TNPGGHZOK2" -> (known after apply)
      ~ secret                 = (sensitive value)
        # (3 unchanged attributes hidden)

      ~ owner {
          ~ api_version = "iam/v2" # forces replacement -> (known after apply) # forces replacement
          ~ id          = "sa-g1j58r" # forces replacement -> (known after apply) # forces replacement
          ~ kind        = "ServiceAccount" # forces replacement -> (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # confluent_role_binding.platform-manager-kafka-cluster-admin must be replaced
-/+ resource "confluent_role_binding" "platform-manager-kafka-cluster-admin" {
      ~ id          = "rb-0O4DN" -> (known after apply)
      ~ principal   = "User:sa-g1j58r" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # confluent_service_account.platform-manager must be replaced
-/+ resource "confluent_service_account" "platform-manager" {
      ~ api_version  = "iam/v2" -> (known after apply)
      ~ display_name = "platform-manager" -> "platform-manager-env-d9d2z7" # forces replacement
      ~ id           = "sa-g1j58r" -> (known after apply)
      ~ kind         = "ServiceAccount" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

```

</details>
*Pushed by: @gphilipp, Action: `pull_request`*